src/InformationRegisters/КредитныеЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>КредитныеЛимиты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗадолженностьКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьКонтрагентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonModules/КредитныеЛимитыСервер/Ext/Module.bsl
Функция ПолучитьОстатокЛимита(Период, Клиент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КредитныеЛимитыСрезПоследних.Клиент КАК Клиент,
	               |	КредитныеЛимитыСрезПоследних.СуммаЛимита КАК СуммаЛимита
	               |ПОМЕСТИТЬ КредитныйЛимит
	               |ИЗ
	               |	РегистрСведений.КредитныеЛимиты.СрезПоследних(&Период, Клиент = &Клиент) КАК КредитныеЛимитыСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗадолженностьКонтрагентовОстатки.Клиент КАК Клиент,
	               |	ЗадолженностьКонтрагентовОстатки.СуммаОстаток КАК СуммаОстаток
	               |ПОМЕСТИТЬ Задолженность
	               |ИЗ
	               |	РегистрНакопления.ЗадолженностьКонтрагентов.Остатки(&Период, Клиент = &Клиент) КАК ЗадолженностьКонтрагентовОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КредитныйЛимит.Клиент КАК Клиент,
	               |	КредитныйЛимит.СуммаЛимита КАК СуммаЛимита,
	               |	ЕСТЬNULL(Задолженность.СуммаОстаток, 0) КАК СуммаЗадолженности,
	               |	КредитныйЛимит.СуммаЛимита - ЕСТЬNULL(Задолженность.СуммаОстаток,0) КАК ОстатокЛимита
	               |ИЗ
	               |	КредитныйЛимит КАК КредитныйЛимит
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Задолженность КАК Задолженность
	               |		ПО КредитныйЛимит.Клиент = Задолженность.Клиент";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.ОстатокЛимита 
	Иначе
		Возврат 0;
	
	КонецЕсли;

КонецФункции // ПолучитьОстатокЛимита()
